<h4 style='color:green' >Handlling Date and Time</h4>

Most datasets have dtypes set to object for date and time. Having that, we cannot extract information like which day it is? what Decade? which quarter etc?
so handling date and time is essential. To begin with, first thing we have to do is to change its datatype to datetime.

In [362]:
import numpy as np
import pandas as pd

In [363]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

<h5>Working with Date</h5>

In [365]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [366]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [367]:
date.drop(columns=['product_id', 'city_id', 'orders'], inplace=True)

In [368]:
date['date'] = pd.to_datetime(date['date'], errors='coerce')  # setting errors='coerce' results any invalid parsing as :const:`NaT`.

In [369]:
date.head()

        date
0 2019-12-10
1 2018-08-15
2 2018-10-23
3 2019-08-17
4 2019-01-06

In [370]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [371]:
# extract day of the week
date['day_of_week'] = date['date'].dt.dayofweek

In [372]:
# extract the names for each day
date['day_name'] = date['date'].dt.day_name()

In [373]:
# extract month number
date['month_no'] = date['date'].dt.month

In [374]:
# extract the name of month
date['month_names'] = date['date'].dt.month_name()

In [375]:
# extract the year
date['year'] = date['date'].dt.year

In [376]:
# extract quarter
date['quarter'] = date['date'].dt.quarter

In [377]:
# Check if the day is weekend
date['is_weekend'] = np.where(date['day_name'].isin(['Sunday', 'Saturday']), True, False)

In [378]:
# Check the semester of the year
date['semester'] = np.where(date['quarter'].isin([1, 2]), 1, 2)

In [379]:
date.head()

,date,day_of_week,day_name,month_no,month_names,year,quarter,is_weekend,semester
0,2019-12-10,1,Tuesday,12,December,2019,4,False,2
1,2018-08-15,2,Wednesday,8,August,2018,3,False,2
2,2018-10-23,1,Tuesday,10,October,2018,4,False,2
3,2019-08-17,5,Saturday,8,August,2019,3,True,2
4,2019-01-06,6,Sunday,1,January,2019,1,True,1

<h5>Calculating date differences</h5>

In [381]:
import datetime
today = datetime.datetime.today()

In [382]:
today - date['date']

0     1862 days 01:44:46.240714
1     2344 days 01:44:46.240714
2     2275 days 01:44:46.240714
3     1977 days 01:44:46.240714
4     2200 days 01:44:46.240714
                 ...
995   2290 days 01:44:46.240714
996   2231 days 01:44:46.240714
997   2079 days 01:44:46.240714
998   2144 days 01:44:46.240714
999   1918 days 01:44:46.240714
Name: date, Length: 1000, dtype: timedelta64[ns]

In [383]:
total_days_passed = (today - date['date']).dt.days
total_month_passed = ((today.year - date['year']) * 12) + (today.month - date['month_no'])
total_year_passed = np.round(total_month_passed / 12)

In [384]:
print("Date passed since last order")
df = pd.DataFrame({'Days_Passed': total_days_passed, 'Months_Passed': total_month_passed, 'Years_passed': total_year_passed})
df.head()

Date passed since last order

   Days_Passed  Months_Passed  Years_passed
0         1862             61           5.0
1         2344             77           6.0
2         2275             75           6.0
3         1977             65           5.0
4         2200             72           6.0

In [385]:
today.month

1

<h5>Working with Time</h5>

In [387]:
time.drop(['msg'], axis=1, inplace=True)

In [388]:
time.head()

                  date
0  2013-12-15 00:50:00
1  2014-04-29 23:40:00
2  2012-12-30 00:21:00
3  2014-11-28 00:31:00
4  2013-10-26 23:11:00

In [389]:
time['date'].dtype

dtype('O')

In [430]:
time['date'] = pd.to_datetime(time['date'], errors='coerce')
time['date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: date
Non-Null Count  Dtype
--------------  -----
1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 7.9 KB

In [436]:
# extract date and time part from the date column to a separate column
time['date_only'] = time['date'].dt.date
time['time_only'] = time['date'].dt.time

In [438]:
time.head()

                 date   date_only time_only
0 2013-12-15 00:50:00  2013-12-15  00:50:00
1 2014-04-29 23:40:00  2014-04-29  23:40:00
2 2012-12-30 00:21:00  2012-12-30  00:21:00
3 2014-11-28 00:31:00  2014-11-28  00:31:00
4 2013-10-26 23:11:00  2013-10-26  23:11:00

The dtype of the time_extracted is object so we need to change it to 'datetime' dtypes to extract second, minutes and hours.

In [442]:
time_only.dtype

dtype('O')

Now, after the dates and times are splitted, they are again an object datatypes. so, converting to datetime again. Since python doesn't have case to only work with time, we need add some dates into our time_only column to make it work.

In [449]:
time["time_only_as_dt"] = pd.to_datetime("190-01-01 " + time["time_only"].astype(str))

KeyError: "None of [Index([00:50:00, 23:40:00, 00:21:00, 00:31:00, 23:11:00, 22:52:00, 00:23:00,\n       01:10:00, 01:20:00, 23:46:00,\n       ...\n       00:15:00, 01:20:00, 01:17:00, 23:02:00, 00:01:00, 00:50:00, 23:14:00,\n       23:37:00, 23:34:00, 23:25:00],\n      dtype='object', length=1000)] are in the [columns]"